Revit 2026 API

# VertexBufferUnmap Method

---

Unmaps the buffer, so that it can be used for rendering.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Unmap()
```
```vb
Public Sub Unmap
```
```cpp
public:
void Unmap()
```
```fsharp
member Unmap : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This VertexBuffer is not available because Revit is not currently rendering. In general, this VertexBuffer must be used in the scope of the RenderScene() callback of IDirectContext3DServer. |

#### Reference

VertexBuffer Class

Autodesk.Revit.DB.DirectContext3D Namespace